# inherited conepts from R , oracle . It's like table in databse . 2D(row,column)

In [1]:
#Data frame - tabular representation of data

In [1]:
#Create a data frame

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data=np.random.randn(5,3)

In [5]:
pd.DataFrame(data)

          0         1         2
0  1.705031 -0.821536 -0.219967
1 -1.347595  0.780174  0.056401
2 -2.718463 -0.397544 -1.866284
3  1.492038  1.246511 -0.446407
4 -1.456054 -0.547949  0.658029

In [6]:
pd.DataFrame(data,columns=['A','B','C'])

          A         B         C
0  1.705031 -0.821536 -0.219967
1 -1.347595  0.780174  0.056401
2 -2.718463 -0.397544 -1.866284
3  1.492038  1.246511 -0.446407
4 -1.456054 -0.547949  0.658029

In [7]:
pd.read_csv('Pandas_Series1.csv')

   ID Name  age
0   1    a   12
1   2    b   31
2   3   bc   23
3   4    d   21
4   6    s   65
5   7    f   67
6   8    h   38
7   9    h   92
8  10   vs   12

In [8]:
#letssay that  ID Name age are not colunm headers and you want ot create your own headers

In [10]:
headers=["col1","col2","col3"]

In [11]:
df=pd.read_csv('Pandas_Series1.csv', header=None, names=headers)

In [12]:
df

  col1  col2 col3
0   ID  Name  age
1    1     a   12
2    2     b   31
3    3    bc   23
4    4     d   21
5    6     s   65
6    7     f   67
7    8     h   38
8    9     h   92
9   10    vs   12

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.head()

  col1  col2 col3
0   ID  Name  age
1    1     a   12
2    2     b   31
3    3    bc   23
4    4     d   21

In [15]:
df.head(2)

  col1  col2 col3
0   ID  Name  age
1    1     a   12

In [16]:
df.tail()

  col1 col2 col3
5    6    s   65
6    7    f   67
7    8    h   38
8    9    h   92
9   10   vs   12

In [17]:
df.count()

col1    10
col2    10
col3    10
dtype: int64

In [18]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [19]:
df.values

array([['ID', 'Name', 'age'],
       ['1', 'a', '12'],
       ['2', 'b', '31'],
       ['3', 'bc', '23'],
       ['4', 'd', '21'],
       ['6', 's', '65'],
       ['7', 'f', '67'],
       ['8', 'h', '38'],
       ['9', 'h', '92'],
       ['10', 'vs', '12']], dtype=object)

In [20]:
df.shape

(10, 3)

In [23]:
df.size

30

In [24]:
df.dtypes

col1    object
col2    object
col3    object
dtype: object

In [22]:
#here we canchange thecolumn type if its not correctly interepted

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    10 non-null     object
 1   col2    10 non-null     object
 2   col3    10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [24]:
#last line tells us how manycolumns exists of which type

In [26]:
df.describe()

       col1 col2 col3
count    10   10   10
unique   10    9    9
top      ID    h   12
freq      1    2    2

In [27]:
df1= pd.read_csv("Pandas_Series1.csv")

In [28]:
df1

   ID Name  age
0   1    a   12
1   2    b   31
2   3   bc   23
3   4    d   21
4   6    s   65
5   7    f   67
6   8    h   38
7   9    h   92
8  10   vs   12

In [29]:
df1.describe()

              ID        age
count   9.000000   9.000000
mean    5.555556  40.111111
std     3.205897  28.197715
min     1.000000  12.000000
25%     3.000000  21.000000
50%     6.000000  31.000000
75%     8.000000  65.000000
max    10.000000  92.000000

# Add new column

In [30]:
df1= pd.read_csv("Pandas_Series1.csv")

In [31]:
df1

   ID Name  age
0   1    a   12
1   2    b   31
2   3   bc   23
3   4    d   21
4   6    s   65
5   7    f   67
6   8    h   38
7   9    h   92
8  10   vs   12

In [32]:
# add new column salary
df1['salary']=0

In [33]:
df1

   ID Name  age  salary
0   1    a   12       0
1   2    b   31       0
2   3   bc   23       0
3   4    d   21       0
4   6    s   65       0
5   7    f   67       0
6   8    h   38       0
7   9    h   92       0
8  10   vs   12       0

In [34]:
df1['Comm']=[1,2,3,4,5,6,7,8,9]

In [35]:
df1

   ID Name  age  salary  Comm
0   1    a   12       0     1
1   2    b   31       0     2
2   3   bc   23       0     3
3   4    d   21       0     4
4   6    s   65       0     5
5   7    f   67       0     6
6   8    h   38       0     7
7   9    h   92       0     8
8  10   vs   12       0     9

In [36]:
df1['Bonus']=df1['salary']+df1['Comm']*100

In [37]:
df1

   ID Name  age  salary  Comm  Bonus
0   1    a   12       0     1    100
1   2    b   31       0     2    200
2   3   bc   23       0     3    300
3   4    d   21       0     4    400
4   6    s   65       0     5    500
5   7    f   67       0     6    600
6   8    h   38       0     7    700
7   9    h   92       0     8    800
8  10   vs   12       0     9    900

In [38]:
df1.shape

(9, 6)

#select oneor more columns from data frame

In [47]:
#syntax1 -may or may not work
#syntax2 -always work

In [39]:
#Syntax1== issuewith this is when column name has space-- it will throw syntaxerror  
df1.age

0    12
1    31
2    23
3    21
4    65
5    67
6    38
7    92
8    12
Name: age, dtype: int64

In [40]:
#syntax2
df1["age"]

0    12
1    31
2    23
3    21
4    65
5    67
6    38
7    92
8    12
Name: age, dtype: int64

In [41]:
df1[["age","salary","Bonus"]]

   age  salary  Bonus
0   12       0    100
1   31       0    200
2   23       0    300
3   21       0    400
4   65       0    500
5   67       0    600
6   38       0    700
7   92       0    800
8   12       0    900

In [42]:
select=["age","salary","Bonus"]

In [43]:
df1[select]

   age  salary  Bonus
0   12       0    100
1   31       0    200
2   23       0    300
3   21       0    400
4   65       0    500
5   67       0    600
6   38       0    700
7   92       0    800
8   12       0    900

# Borad casting operation

In [44]:
df1['Bonus']

0    100
1    200
2    300
3    400
4    500
5    600
6    700
7    800
8    900
Name: Bonus, dtype: int64

In [45]:
df1['Bonus']=df1['Bonus']*2

In [46]:
df1

   ID Name  age  salary  Comm  Bonus
0   1    a   12       0     1    200
1   2    b   31       0     2    400
2   3   bc   23       0     3    600
3   4    d   21       0     4    800
4   6    s   65       0     5   1000
5   7    f   67       0     6   1200
6   8    h   38       0     7   1400
7   9    h   92       0     8   1600
8  10   vs   12       0     9   1800